/**********************************************************************************
***********************************************************************************
**		В этом файле определен класс файла истории переменных состояния
**********************************************************************************
***********************************************************************************/

/********************	ЛИСТ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ	*********************************
*		12.10,2006 - + Теперь этот файл стал глобальным и находится в одной овщей для 
*	всех библиотек директории
*		19.10.2006 - + Добавлен параметр m_Error, куда переписаны все сообщения
*		7.04.2007 - Теперь в ЛогФайл не пишется приоритет 0 при открытии
*************************************************************************************/

#pragma once
#include <fstream>
#include <ERRORS\ERRORS.h>
using namespace std;

/*****************************************************************************************
*		Произведем настройку программы
*****************************************************************************************/
#define NUM 1


#ifdef VAR_1
#undef NUM
#define NUM (NUM+1)
#endif



class HISTORY_FILE_Class
{
	//в нем фиксируются переменные состояния процессов на контроллере (по к-м строится график)
	ofstream File;
	CString Names[10];
	
public:
	//Записывает в файл истории ПС
	bool Write(float * mas,unsigned char count=0);
	// открывает файл записи переменных состояния
	bool Open(void);
	//закрывает файл
	bool Close(void);
	//сколько всего записей
	unsigned char count_of_items;

	ERROR_Class m_Error;//структура, в которой содержатся допущенные ошибки

	~HISTORY_FILE_Class();	//деструктоор
	HISTORY_FILE_Class();	//конструктор
};