/******************************************************************************************
*********************************************************************************************
**		Этот модуль содержит функции преобразования массива чисел в строку где
**	эти числа отображаются в шестнадцатеричной форме и обратно
********************************************************************************************
********************************************************************************************/

/************************	ЛИСТ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ	*************************************
*	26.03.07г - фунции выдраны из PROTOCOL_Struct
*	30.03.07г - в функции GiveHexFromStr появилась возможность оповестить внешний мир об ошибках
*				а также доплнительное распознавание ошибок
*	18.09.2008 - первая попытка поддрежки UNICODE
*	8.10.2008 - функция GiveStrFromHex стала качественней
**********************************************************************************************/
#pragma once
#include <tchar.h>

// выдает шестнадцатеричные значения буфера
CString GiveStrFromHex(unsigned char * mes, size_t len);
// конвертирует строку, в которой шестнадцатеричные значения в массив чисел
unsigned short GiveHexFromStr(CString str,unsigned char * mas,CString* error);