/******************************************************************************
*******************************************************************************
**		В этой библиотеке я собрал различные полезные математические 
**	фишки, как например подсчет числа 1-х битов байте
*******************************************************************************
******************************************************************************/

/*****************************************************************************
*			ЛИСТ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ
*	14.11.2008 - передран с MCC30, добавлен макрос ROUND
*****************************************************************************/
#ifndef MATH_EX_MODULE
#define MATH_EX_MODULE
	
#include "types_visual_c++.h"		//файл с моими типами

//число ПИ
#define MATH_PI	3.14159265358979323846

//макрос округления
#define ROUND(x) (INT32S)(x+0.5-(FP32)(x<0))

//фукнция подсчета 1-х битов в байте
INT8U BitCount_INT8(INT8U x);

#endif	//конец защиты от дурака
