/***********************************************************************
************************************************************************
**		В этом модуле находятся мои функции работы с RS-232 - USB пре-
**	образователями CP210x.
************************************************************************
***********************************************************************/

/***********************************************************************
*						ЛИСТ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ
*	10.04.2008 - создан
************************************************************************/
#pragma once
#include "CP210xManufacturingDLL.h"				//| библиотека от производителя (+ DLL)
#pragma comment(lib,"CP210xManufacturing.lib")	//| этот файл нужно вложить в директорию компилируемого проекта

//Возвращает номер последовательного порта устройства
int GetPortNumXP2000Vista(WORD vid, WORD pid, TCHAR* ser);
